{"modelTopology":{"class_name":"Sequential","config":[{"class_name":"Flatten","config":{"name":"flatten_Flatten1","trainable":true,"batch_input_shape":[null,7,7,256],"dtype":"float32"}},{"class_name":"Dense","config":{"units":800,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":null,"distribution":null,"seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense1","trainable":true}},{"class_name":"Dense","config":{"units":16,"activation":"softmax","use_bias":false,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":null,"distribution":null,"seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense2","trainable":true}}],"keras_version":"tfjs-layers 0.8.0","backend":"tensor_flow.js"},"weightsManifest":[{"paths":["model.weights.bin"],"weights":[{"name":"dense_Dense1/kernel","shape":[12544,800],"dtype":"float32"},{"name":"dense_Dense1/bias","shape":[800],"dtype":"float32"},{"name":"dense_Dense2/kernel","shape":[800,16],"dtype":"float32"}]}],"ml5Specs":{"mapStringToIndex":["博麗霊夢","霧雨魔理沙","十六夜咲夜","レミリア・スカーレット","フランドール・スカーレット","チルノ","アリス・マーガトロイド","魂魄妖夢","西行寺幽々子","八雲紫","鈴仙・優曇華院・イナバ","八意永琳","射命丸文","古明地こいし","鬼人正邪","クラウンピース"]}}